In [35]:
import pandas as pd

## Series

In [36]:
data = [1, 2, 3, 4, 5]

In [37]:
s = pd.Series(data)

In [38]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [39]:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [40]:
s = pd.Series(data, index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

Outra maneira de criar series, usando um dicion√°rio

In [41]:
data = {'Linha'+str(i) : i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [42]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [43]:
s1 = s + 2
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [44]:
s2 = s+s1
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Dataframes

In [45]:
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

In [46]:
df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [47]:
index = ['Linha'+str(i) for i in range(3)]
index

['Linha0', 'Linha1', 'Linha2']

In [48]:
df1 = pd.DataFrame(data, index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [49]:
columns = ['Coluna'+str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [50]:
df2 = pd.DataFrame(data, index, columns)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Outra maneira de criar dataframe, utilizando um dicion√°rio

In [51]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
        'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
        'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [52]:
df3 = pd.DataFrame(data)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Podemos alcan√ßar o mesmo resultado utilizando uma lista de tuplas

In [53]:
data = [(1, 2, 3), 
        (4, 5, 6), 
        (7, 8, 9)]

In [54]:
df4 = pd.DataFrame(data, index, columns)
df4

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

Modifica√ß√µes simples num dataframe

In [55]:
df1[df1>0] = 'A'
df1

        0  1  2
Linha0  A  A  A
Linha1  A  A  A
Linha2  A  A  A

In [56]:
df2[df2>0] = 'B'
df2

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [57]:
df3[df3>0] = 'C'
df3

       Coluna0 Coluna1 Coluna2
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C

Concatenando dataframes

In [58]:
df5 = pd.concat([df2,df3,df4])
df5

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B
Linha0       C       C       C
Linha1       C       C       C
Linha2       C       C       C
Linha0       1       2       3
Linha1       4       5       6
Linha2       7       8       9

Outro modo √© a liga√ß√£o entre tabelas se dar pelas linhas, e n√£o pelas colunas.

In [59]:
df4 = pd.concat([df2,df3,df4], axis=1)
df4

,Coluna0,Coluna1,Coluna2,Coluna0,Coluna1,Coluna2,Coluna0,Coluna1,Coluna2
Linha0,B,B,B,C,C,C,1,2,3
Linha1,B,B,B,C,C,C,4,5,6
Linha2,B,B,B,C,C,C,7,8,9